# DataQuest project working with SQL

In [10]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [11]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table'

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [12]:
%%sql
SELECT *
  FROM facts
 LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [13]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

## Identify the countries with 0 population and 7.2 billion population.

In [18]:
%%sql
SELECT name, population
  FROM facts
 WHERE population == (SELECT MIN(population)
                        FROM facts
                     )

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

In [19]:
%%sql
SELECT name, population
  FROM facts
 WHERE population == (SELECT MAX(population)
                        FROM facts
                     )

 * sqlite:///factbook.db
Done.

[('World', 7256490011)]

## Recalculate population statistics with "world" entry removed.

In [20]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

## Calculate average value of population and area.

In [22]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts
 WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

## Find densley populated countries

In [24]:
%%sql
SELECT name, population, area, population / area AS 'Density'
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                      WHERE name <> 'World')
   AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name <> 'World')
   AND name <> 'World'
 ORDER BY Density

 * sqlite:///factbook.db
Done.

[('Morocco', 33322699, 446550, 74),
 ('Iraq', 37056169, 438317, 84),
 ('Spain', 48146134, 505370, 95),
 ('Poland', 38562189, 312685, 123),
 ('Thailand', 67976405, 513120, 132),
 ('Uganda', 37101745, 241038, 153),
 ('Italy', 61855120, 301340, 205),
 ('Germany', 80854408, 357022, 226),
 ('United Kingdom', 64088222, 243610, 263),
 ('Vietnam', 94348835, 331210, 284),
 ('Japan', 126919659, 377915, 335),
 ('Philippines', 100998376, 300000, 336),
 ('Korea, South', 49115196, 99720, 492),
 ('Bangladesh', 168957745, 148460, 1138)]